NFe/wsdl/AM/homologacao/4.00/NfeStatusServico.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions
    
     targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4"
     xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
     xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
     xmlns:s="http://www.w3.org/2001/XMLSchema"
     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
     xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
     xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"
     xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    >
    <wsdl:types>
        <s:schema elementFormDefault="qualified" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4">
            <s:element name="nfeDadosMsg">
                <s:complexType mixed="true">
                    <s:sequence>
                        <s:any/>
                    </s:sequence>
                </s:complexType>
            </s:element>
            <s:element name="nfeResultMsg" nillable="true">
                <s:complexType mixed="true">
                    <s:sequence>
                        <s:any/>
                    </s:sequence>
                </s:complexType>
            </s:element>
        </s:schema>
    </wsdl:types>
    <wsdl:message name="nfeStatusServicoNFSoapIn">
        <wsdl:part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
    </wsdl:message>
    <wsdl:message name="nfeStatusServicoNFSoapOut">
        <wsdl:part name="nfeStatusServicoNFResult" element="tns:nfeResultMsg"/>
    </wsdl:message>
    <wsdl:portType name="NfeStatusServico4Soap">
        <wsdl:operation name="nfeStatusServicoNF">
            <wsdl:input message="tns:nfeStatusServicoNFSoapIn"/>
            <wsdl:output message="tns:nfeStatusServicoNFSoapOut"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="NfeStatusServico4Soap" type="tns:NfeStatusServico4Soap">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="nfeStatusServicoNF">
            <soap:operation style="document" soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="NfeStatusServico4Soap12" type="tns:NfeStatusServico4Soap">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="nfeStatusServicoNF">
            <soap12:operation style="document" soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF"
                 soapActionRequired="false"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="NfeStatusServico4">
        <wsdl:port name="NfeStatusServico4Soap12" binding="tns:NfeStatusServico4Soap12">
            <soap12:address location="https://homnfe.sefaz.am.gov.br/services2/services/NfeStatusServico4"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
