backend/templates/nfeStatusServico4.msg

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:nfes="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4">
   <soap:Body>
      <nfes:nfeDadosMsg><consStatServ xmlns="http://www.portalfiscal.inf.br/nfe" versao="4.00"><tpAmb>$tpAmb</tpAmb><cUF>$cUF</cUF><xServ>STATUS</xServ></consStatServ></nfes:nfeDadosMsg>
   </soap:Body>
</soap:Envelope>