demonstracoes/delphi/Win32/Debug/Templates/vm60/BA/pedido_status.soap

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:nfes="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4"><soap:Header/><soap:Body><nfes:nfeDadosMsg>%s</nfes:nfeDadosMsg></soap:Body></soap:Envelope>